epccs/AVR-Dx_DFP/edc/AVR128DA28.PIC
        <edc:SFRDef edc:_addr="0x243" edc:access="nnnnnnnn" edc:cname="USERTCB2CAPT" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
              <edc:SFRFieldDef edc:cname="USER" edc:desc="User channel select" edc:nzwidth="0x8">
                <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Off" edc:when="(field &amp; 0xFF) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL0" edc:desc="Connect user to event channel 0" edc:when="(field &amp; 0xFF) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL1" edc:desc="Connect user to event channel 1" edc:when="(field &amp; 0xFF) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL2" edc:desc="Connect user to event channel 2" edc:when="(field &amp; 0xFF) == 0x3"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL3" edc:desc="Connect user to event channel 3" edc:when="(field &amp; 0xFF) == 0x4"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL4" edc:desc="Connect user to event channel 4" edc:when="(field &amp; 0xFF) == 0x5"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL5" edc:desc="Connect user to event channel 5" edc:when="(field &amp; 0xFF) == 0x6"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL6" edc:desc="Connect user to event channel 6" edc:when="(field &amp; 0xFF) == 0x7"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL7" edc:desc="Connect user to event channel 7" edc:when="(field &amp; 0xFF) == 0x8"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL8" edc:desc="Connect user to event channel 8" edc:when="(field &amp; 0xFF) == 0x9"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL9" edc:desc="Connect user to event channel 9" edc:when="(field &amp; 0xFF) == 0xA"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x244" edc:access="nnnnnnnn" edc:cname="USERTCB2COUNT" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
              <edc:SFRFieldDef edc:cname="USER" edc:desc="User channel select" edc:nzwidth="0x8">
                <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Off" edc:when="(field &amp; 0xFF) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL0" edc:desc="Connect user to event channel 0" edc:when="(field &amp; 0xFF) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL1" edc:desc="Connect user to event channel 1" edc:when="(field &amp; 0xFF) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL2" edc:desc="Connect user to event channel 2" edc:when="(field &amp; 0xFF) == 0x3"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL3" edc:desc="Connect user to event channel 3" edc:when="(field &amp; 0xFF) == 0x4"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL4" edc:desc="Connect user to event channel 4" edc:when="(field &amp; 0xFF) == 0x5"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL5" edc:desc="Connect user to event channel 5" edc:when="(field &amp; 0xFF) == 0x6"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL6" edc:desc="Connect user to event channel 6" edc:when="(field &amp; 0xFF) == 0x7"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL7" edc:desc="Connect user to event channel 7" edc:when="(field &amp; 0xFF) == 0x8"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL8" edc:desc="Connect user to event channel 8" edc:when="(field &amp; 0xFF) == 0x9"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL9" edc:desc="Connect user to event channel 9" edc:when="(field &amp; 0xFF) == 0xA"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x245" edc:access="nnnnnnnn" edc:cname="USERTCB3CAPT" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="EVSYS">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="EVSYS">
              <edc:SFRFieldDef edc:cname="USER" edc:desc="User channel select" edc:nzwidth="0x8">
                <edc:SFRFieldSemantic edc:cname="OFF" edc:desc="Off" edc:when="(field &amp; 0xFF) == 0x0"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL0" edc:desc="Connect user to event channel 0" edc:when="(field &amp; 0xFF) == 0x1"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL1" edc:desc="Connect user to event channel 1" edc:when="(field &amp; 0xFF) == 0x2"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL2" edc:desc="Connect user to event channel 2" edc:when="(field &amp; 0xFF) == 0x3"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL3" edc:desc="Connect user to event channel 3" edc:when="(field &amp; 0xFF) == 0x4"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL4" edc:desc="Connect user to event channel 4" edc:when="(field &amp; 0xFF) == 0x5"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL5" edc:desc="Connect user to event channel 5" edc:when="(field &amp; 0xFF) == 0x6"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL6" edc:desc="Connect user to event channel 6" edc:when="(field &amp; 0xFF) == 0x7"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL7" edc:desc="Connect user to event channel 7" edc:when="(field &amp; 0xFF) == 0x8"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL8" edc:desc="Connect user to event channel 8" edc:when="(field &amp; 0xFF) == 0x9"/>
                <edc:SFRFieldSemantic edc:cname="CHANNEL9" edc:desc="Connect user to event channel 9" edc:when="(field &amp; 0xFF) == 0xA"/>
              </edc:SFRFieldDef>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
