epccs/AVR-Dx_DFP/edc/AVR128DA28.PIC
        <edc:SFRDef edc:_addr="0x1003" edc:access="-------n" edc:cname="INTCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVMCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
              <edc:SFRFieldDef edc:cname="EEREADY" edc:desc="EEPROM Ready" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:_addr="0x1004" edc:access="-------n" edc:cname="INTFLAGS" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="NVMCTRL">
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="NVMCTRL">
              <edc:SFRFieldDef edc:cname="EEREADY" edc:desc="EEPROM Ready" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:_addr="0x1005" edc:offset="0x1"/>
        <edc:SFRDef edc:_addr="0x1006" edc:access="nnnnnnnnnnnnnnnn" edc:cname="DATA" edc:nzwidth="0x10" ltx:memberofperipheral="NVMCTRL"/>
        <edc:SFRDef edc:_addr="0x1008" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADDR" edc:nzwidth="0x20" ltx:memberofperipheral="NVMCTRL"/>
      </edc:SFRDataSector>
      <edc:ConfigFuseSector atdf:pagesize="0x1" edc:beginaddr="0x1040" edc:endaddr="0x1044" edc:magicoffset="0x830000" edc:regionid="LOCKBITS">
        <edc:DCRDef edc:_addr="0x1040" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="KEY" edc:factorydefault="0x5CC5C55C" edc:impl="0xFFFFFFFF" edc:nzwidth="0x20" edc:unused="0x0" edc:useinchecksum="0xFFFFFFFF" ltx:memberofperipheral="LOCK">
          <edc:DCRModeList>
            <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="LOCK">
              <edc:DCRFieldDef edc:cname="KEY" edc:desc="Lock Key" edc:nzwidth="0x20">
                <edc:DCRFieldSemantic edc:cname="NOLOCK" edc:desc="No locks" edc:when="(field &amp; 0xFFFFFFFF) == 0x5CC5C55C"/>
                <edc:DCRFieldSemantic edc:cname="RWLOCK" edc:desc="Read and write lock" edc:when="(field &amp; 0xFFFFFFFF) == 0xA33A3AA3"/>
              </edc:DCRFieldDef>
            </edc:DCRMode>
          </edc:DCRModeList>
        </edc:DCRDef>
      </edc:ConfigFuseSector>
      <edc:DeviceIDSector atdf:pagesize="0x80" edc:beginaddr="0x1103" edc:endaddr="0x1180" edc:regionid="PROD_SIGNATURES" edc:value="0x1E970A">
        <edc:AdjustPoint edc:_addr="0x1103" edc:offset="0x1"/>
        <edc:DCRDef edc:_addr="0x1104" edc:access="rrrrrrrrrrrrrrrr" edc:cname="TEMPSENSE0" edc:factorydefault="0x0" edc:impl="0xFFFF" edc:nzwidth="0x10" edc:unused="0x0" edc:useinchecksum="0xFFFF" ltx:memberofperipheral="SIGROW">
          <edc:DCRModeList>
            <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="SIGROW">
              <edc:DCRFieldDef edc:cname="TEMPSENSE0" edc:desc="Temperature Calibration 0" edc:nzwidth="0x10"/>
            </edc:DCRMode>
          </edc:DCRModeList>
        </edc:DCRDef>
        <edc:DCRDef edc:_addr="0x1106" edc:access="rrrrrrrrrrrrrrrr" edc:cname="TEMPSENSE1" edc:factorydefault="0x0" edc:impl="0xFFFF" edc:nzwidth="0x10" edc:unused="0x0" edc:useinchecksum="0xFFFF" ltx:memberofperipheral="SIGROW">
          <edc:DCRModeList>
            <edc:DCRMode edc:id="DS.0" ltx:memberofperipheral="SIGROW">
              <edc:DCRFieldDef edc:cname="TEMPSENSE1" edc:desc="Temperature Calibration 1" edc:nzwidth="0x10"/>
            </edc:DCRMode>
          </edc:DCRModeList>
        </edc:DCRDef>
        <edc:AdjustPoint edc:_addr="0x1108" edc:offset="0x8"/>
        <edc:DCRDef edc:_addr="0x1110" edc:access="rrrrrrrr" edc:cname="SERNUM0" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1111" edc:access="rrrrrrrr" edc:cname="SERNUM1" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1112" edc:access="rrrrrrrr" edc:cname="SERNUM2" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1113" edc:access="rrrrrrrr" edc:cname="SERNUM3" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1114" edc:access="rrrrrrrr" edc:cname="SERNUM4" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1115" edc:access="rrrrrrrr" edc:cname="SERNUM5" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1116" edc:access="rrrrrrrr" edc:cname="SERNUM6" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1117" edc:access="rrrrrrrr" edc:cname="SERNUM7" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1118" edc:access="rrrrrrrr" edc:cname="SERNUM8" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1119" edc:access="rrrrrrrr" edc:cname="SERNUM9" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x111A" edc:access="rrrrrrrr" edc:cname="SERNUM10" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x111B" edc:access="rrrrrrrr" edc:cname="SERNUM11" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x111C" edc:access="rrrrrrrr" edc:cname="SERNUM12" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x111D" edc:access="rrrrrrrr" edc:cname="SERNUM13" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x111E" edc:access="rrrrrrrr" edc:cname="SERNUM14" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x111F" edc:access="rrrrrrrr" edc:cname="SERNUM15" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
      </edc:DeviceIDSector>
      <edc:DeviceIDSector atdf:pagesize="0x80" edc:beginaddr="0x1100" edc:endaddr="0x1103" edc:regionid="SIGNATURES" edc:value="0x1E970A">
        <edc:DCRDef edc:_addr="0x1100" edc:access="rrrrrrrr" edc:cname="DEVICEID0" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1101" edc:access="rrrrrrrr" edc:cname="DEVICEID1" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
        <edc:DCRDef edc:_addr="0x1102" edc:access="rrrrrrrr" edc:cname="DEVICEID2" edc:factorydefault="0x0" edc:impl="0x0" edc:nzwidth="0x8" edc:unused="0x0" edc:useinchecksum="0xFF" ltx:memberofperipheral="SIGROW"/>
      </edc:DeviceIDSector>
      <edc:UserIDSector atdf:pagesize="0x20" edc:beginaddr="0x1080" edc:endaddr="0x10A0" edc:magicoffset="0x850000" edc:regionid="USER_SIGNATURES">
        <edc:SFRDef edc:_addr="0x1080" edc:access="nnnnnnnn" edc:cname="USERROW0" edc:nzwidth="0x8" ltx:memberofperipheral="USERROW"/>
        <edc:SFRDef edc:_addr="0x1081" edc:access="nnnnnnnn" edc:cname="USERROW1" edc:nzwidth="0x8" ltx:memberofperipheral="USERROW"/>
        <edc:SFRDef edc:_addr="0x1082" edc:access="nnnnnnnn" edc:cname="USERROW2" edc:nzwidth="0x8" ltx:memberofperipheral="USERROW"/>
        <edc:SFRDef edc:_addr="0x1083" edc:access="nnnnnnnn" edc:cname="USERROW3" edc:nzwidth="0x8" ltx:memberofperipheral="USERROW"/>
        <edc:SFRDef edc:_addr="0x1084" edc:access="nnnnnnnn" edc:cname="USERROW4" edc:nzwidth="0x8" ltx:memberofperipheral="USERROW"/>
        <edc:SFRDef edc:_addr="0x1085" edc:access="nnnnnnnn" edc:cname="USERROW5" edc:nzwidth="0x8" ltx:memberofperipheral="USERROW"/>
        <edc:SFRDef edc:_addr="0x1086" edc:access="nnnnnnnn" edc:cname="USERROW6" edc:nzwidth="0x8" ltx:memberofperipheral="USERROW"/>
        <edc:SFRDef edc:_addr="0x1087" edc:access="nnnnnnnn" edc:cname="USERROW7" edc:nzwidth="0x8" ltx:memberofperipheral="USERROW"/>
        <edc:SFRDef edc:_addr="0x1088" edc:access="nnnnnnnn" edc:cname="USERROW8" edc:nzwidth="0x8" ltx:memberofperipheral="USERROW"/>
        <edc:SFRDef edc:_addr="0x1089" edc:access="nnnnnnnn" edc:cname="USERROW9" edc:nzwidth="0x8" ltx:memberofperipheral="USERROW"/>
        <edc:SFRDef edc:_addr="0x108A" edc:access="nnnnnnnn" edc:cname="USERROW10" edc:nzwidth="0x8" ltx:memberofperipheral="USERROW"/>
        <edc:SFRDef edc:_addr="0x108B" edc:access="nnnnnnnn" edc:cname="USERROW11" edc:nzwidth="0x8" ltx:memberofperipheral="USERROW"/>
        <edc:SFRDef edc:_addr="0x108C" edc:access="nnnnnnnn" edc:cname="USERROW12" edc:nzwidth="0x8" ltx:memberofperipheral="USERROW"/>
        <edc:SFRDef edc:_addr="0x108D" edc:access="nnnnnnnn" edc:cname="USERROW13" edc:nzwidth="0x8" ltx:memberofperipheral="USERROW"/>
        <edc:SFRDef edc:_addr="0x108E" edc:access="nnnnnnnn" edc:cname="USERROW14" edc:nzwidth="0x8" ltx:memberofperipheral="USERROW"/>
        <edc:SFRDef edc:_addr="0x108F" edc:access="nnnnnnnn" edc:cname="USERROW15" edc:nzwidth="0x8" ltx:memberofperipheral="USERROW"/>
        <edc:SFRDef edc:_addr="0x1090" edc:access="nnnnnnnn" edc:cname="USERROW16" edc:nzwidth="0x8" ltx:memberofperipheral="USERROW"/>
        <edc:SFRDef edc:_addr="0x1091" edc:access="nnnnnnnn" edc:cname="USERROW17" edc:nzwidth="0x8" ltx:memberofperipheral="USERROW"/>
        <edc:SFRDef edc:_addr="0x1092" edc:access="nnnnnnnn" edc:cname="USERROW18" edc:nzwidth="0x8" ltx:memberofperipheral="USERROW"/>
        <edc:SFRDef edc:_addr="0x1093" edc:access="nnnnnnnn" edc:cname="USERROW19" edc:nzwidth="0x8" ltx:memberofperipheral="USERROW"/>
        <edc:SFRDef edc:_addr="0x1094" edc:access="nnnnnnnn" edc:cname="USERROW20" edc:nzwidth="0x8" ltx:memberofperipheral="USERROW"/>
        <edc:SFRDef edc:_addr="0x1095" edc:access="nnnnnnnn" edc:cname="USERROW21" edc:nzwidth="0x8" ltx:memberofperipheral="USERROW"/>
        <edc:SFRDef edc:_addr="0x1096" edc:access="nnnnnnnn" edc:cname="USERROW22" edc:nzwidth="0x8" ltx:memberofperipheral="USERROW"/>
        <edc:SFRDef edc:_addr="0x1097" edc:access="nnnnnnnn" edc:cname="USERROW23" edc:nzwidth="0x8" ltx:memberofperipheral="USERROW"/>
        <edc:SFRDef edc:_addr="0x1098" edc:access="nnnnnnnn" edc:cname="USERROW24" edc:nzwidth="0x8" ltx:memberofperipheral="USERROW"/>
        <edc:SFRDef edc:_addr="0x1099" edc:access="nnnnnnnn" edc:cname="USERROW25" edc:nzwidth="0x8" ltx:memberofperipheral="USERROW"/>
        <edc:SFRDef edc:_addr="0x109A" edc:access="nnnnnnnn" edc:cname="USERROW26" edc:nzwidth="0x8" ltx:memberofperipheral="USERROW"/>
        <edc:SFRDef edc:_addr="0x109B" edc:access="nnnnnnnn" edc:cname="USERROW27" edc:nzwidth="0x8" ltx:memberofperipheral="USERROW"/>
        <edc:SFRDef edc:_addr="0x109C" edc:access="nnnnnnnn" edc:cname="USERROW28" edc:nzwidth="0x8" ltx:memberofperipheral="USERROW"/>
        <edc:SFRDef edc:_addr="0x109D" edc:access="nnnnnnnn" edc:cname="USERROW29" edc:nzwidth="0x8" ltx:memberofperipheral="USERROW"/>
        <edc:SFRDef edc:_addr="0x109E" edc:access="nnnnnnnn" edc:cname="USERROW30" edc:nzwidth="0x8" ltx:memberofperipheral="USERROW"/>
        <edc:SFRDef edc:_addr="0x109F" edc:access="nnnnnnnn" edc:cname="USERROW31" edc:nzwidth="0x8" ltx:memberofperipheral="USERROW"/>
      </edc:UserIDSector>
    </edc:RegardlessOfMode>
    <edc:RegisterMap edc:id="TCA0/SPLIT">
      <edc:SFRDef edc:access="n---nnnn" edc:addr="0xA00" edc:cname="CTRLA" edc:impl="0x8F" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="ENABLE" edc:desc="Module Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKSEL" edc:desc="Clock Selection" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="DIV1" edc:desc="System Clock" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="DIV2" edc:desc="System Clock / 2" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="DIV4" edc:desc="System Clock / 4" edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="DIV8" edc:desc="System Clock / 8" edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="DIV16" edc:desc="System Clock / 16" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="DIV64" edc:desc="System Clock / 64" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="DIV256" edc:desc="System Clock / 256" edc:when="(field &amp; 0x7) == 0x06"/>
              <edc:SFRFieldSemantic edc:cname="DIV1024" edc:desc="System Clock / 1024" edc:when="(field &amp; 0x7) == 0x07"/>
            </edc:SFRFieldDef>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="RUNSTDBY" edc:desc="Run in Standby" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0xA20" edc:cname="LCNT" edc:nzwidth="0x8" ltx:memberofperipheral="TCA0"/>
      <edc:SFRDef edc:access="-nnn-nnn" edc:addr="0xA01" edc:cname="CTRLB" edc:impl="0x77" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="LCMP0EN" edc:desc="Low Compare 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LCMP1EN" edc:desc="Low Compare 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LCMP2EN" edc:desc="Low Compare 2 Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HCMP0EN" edc:desc="High Compare 0 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HCMP1EN" edc:desc="High Compare 1 Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HCMP2EN" edc:desc="High Compare 2 Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0xA21" edc:cname="HCNT" edc:nzwidth="0x8" ltx:memberofperipheral="TCA0"/>
      <edc:SFRDef edc:access="-nnn-nnn" edc:addr="0xA02" edc:cname="CTRLC" edc:impl="0x77" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="LCMP0OV" edc:desc="Low Compare 0 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LCMP1OV" edc:desc="Low Compare 1 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LCMP2OV" edc:desc="Low Compare 2 Output Value" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="HCMP0OV" edc:desc="High Compare 0 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HCMP1OV" edc:desc="High Compare 1 Output Value" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="HCMP2OV" edc:desc="High Compare 2 Output Value" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-------n" edc:addr="0xA03" edc:cname="CTRLD" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="SPLITM" edc:desc="Split Mode Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
