epccs/AVR-Dx_DFP/edc/AVR128DA28.PIC
      <edc:SFRDef edc:access="----nnnn" edc:addr="0xA04" edc:cname="CTRLECLR" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="DIR" edc:desc="Direction" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LUPD" edc:desc="Lock Update" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:desc="Command" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Command" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="UPDATE" edc:desc="Force Update" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="RESTART" edc:desc="Force Restart" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="RESET" edc:desc="Force Hard Reset" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----nnnn" edc:addr="0xA05" edc:cname="CTRLESET" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="DIR" edc:desc="Direction" edc:nzwidth="0x1">
              <edc:SFRFieldSemantic edc:cname="UP" edc:desc="Count up" edc:when="(field &amp; 0x1) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DOWN" edc:desc="Count down" edc:when="(field &amp; 0x1) == 0x1"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="LUPD" edc:desc="Lock Update" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMD" edc:desc="Command" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NONE" edc:desc="No Command" edc:when="(field &amp; 0x3) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="UPDATE" edc:desc="Force Update" edc:when="(field &amp; 0x3) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="RESTART" edc:desc="Force Restart" edc:when="(field &amp; 0x3) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="RESET" edc:desc="Force Hard Reset" edc:when="(field &amp; 0x3) == 0x03"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="----nnnn" edc:addr="0xA06" edc:cname="CTRLFCLR" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="PERBV" edc:desc="Period Buffer Valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP0BV" edc:desc="Compare 0 Buffer Valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP1BV" edc:desc="Compare 1 Buffer Valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP2BV" edc:desc="Compare 2 Buffer Valid" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:addr="0xA26" edc:cname="PER" edc:nzwidth="0x10" ltx:memberofperipheral="TCA0"/>
      <edc:SFRDef edc:access="----nnnn" edc:addr="0xA07" edc:cname="CTRLFSET" edc:impl="0xF" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="PERBV" edc:desc="Period Buffer Valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP0BV" edc:desc="Compare 0 Buffer Valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP1BV" edc:desc="Compare 1 Buffer Valid" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP2BV" edc:desc="Compare 2 Buffer Valid" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:addr="0xA28" edc:cname="CMP0" edc:nzwidth="0x10" ltx:memberofperipheral="TCA0"/>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0xA09" edc:cname="EVCTRL" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="CNTAEI" edc:desc="Count on Event Input A" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVACTA" edc:desc="Event Action A" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="CNT_POSEDGE" edc:desc="Count on positive edge event" edc:when="(field &amp; 0x7) == 0x00"/>
              <edc:SFRFieldSemantic edc:cname="CNT_ANYEDGE" edc:desc="Count on any edge event" edc:when="(field &amp; 0x7) == 0x01"/>
              <edc:SFRFieldSemantic edc:cname="CNT_HIGHLVL" edc:desc="Count on prescaled clock while event line is 1." edc:when="(field &amp; 0x7) == 0x02"/>
              <edc:SFRFieldSemantic edc:cname="UPDOWN" edc:desc="Count on prescaled clock. Event controls count direction. Up-count when event line is 0, down-count when event line is 1." edc:when="(field &amp; 0x7) == 0x03"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CNTBEI" edc:desc="Count on Event Input B" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EVACTB" edc:desc="Event Action B" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="UPDOWN" edc:desc="Count on prescaled clock. Event controls count direction. Up-count when event line is 0, down-count when event line is 1." edc:when="(field &amp; 0x7) == 0x03"/>
              <edc:SFRFieldSemantic edc:cname="RESTART_POSEDGE" edc:desc="Restart counter at positive edge event" edc:when="(field &amp; 0x7) == 0x04"/>
              <edc:SFRFieldSemantic edc:cname="RESTART_ANYEDGE" edc:desc="Restart counter on any edge event" edc:when="(field &amp; 0x7) == 0x05"/>
              <edc:SFRFieldSemantic edc:cname="RESTART_HIGHLVL" edc:desc="Restart counter while event line is 1." edc:when="(field &amp; 0x7) == 0x06"/>
            </edc:SFRFieldDef>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:addr="0xA2A" edc:cname="CMP1" edc:nzwidth="0x10" ltx:memberofperipheral="TCA0"/>
      <edc:SFRDef edc:access="-nnn---n" edc:addr="0xA0A" edc:cname="INTCTRL" edc:impl="0x71" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="OVF" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CMP0" edc:desc="Compare 0 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP1" edc:desc="Compare 1 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP2" edc:desc="Compare 2 Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="-nnn---n" edc:addr="0xA0B" edc:cname="INTFLAGS" edc:impl="0x71" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="OVF" edc:desc="Overflow Interrupt" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x3"/>
            <edc:SFRFieldDef edc:cname="CMP0" edc:desc="Compare 0 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP1" edc:desc="Compare 1 Interrupt" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CMP2" edc:desc="Compare 2 Interrupt" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:addr="0xA2C" edc:cname="CMP2" edc:nzwidth="0x10" ltx:memberofperipheral="TCA0"/>
      <edc:SFRDef edc:access="-------n" edc:addr="0xA0E" edc:cname="DBGCTRL" edc:impl="0x1" edc:mclr="00000000" edc:nzwidth="0x8" edc:por="00000000" ltx:memberofperipheral="TCA0">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0" ltx:memberofperipheral="TCA0">
            <edc:SFRFieldDef edc:cname="DBGRUN" edc:desc="Debug Run" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:access="nnnnnnnn" edc:addr="0xA0F" edc:cname="TEMP" edc:nzwidth="0x8" ltx:memberofperipheral="TCA0"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:addr="0xA36" edc:cname="PERBUF" edc:nzwidth="0x10" ltx:memberofperipheral="TCA0"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:addr="0xA38" edc:cname="CMP0BUF" edc:nzwidth="0x10" ltx:memberofperipheral="TCA0"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:addr="0xA3A" edc:cname="CMP1BUF" edc:nzwidth="0x10" ltx:memberofperipheral="TCA0"/>
      <edc:SFRDef edc:access="nnnnnnnnnnnnnnnn" edc:addr="0xA3C" edc:cname="CMP2BUF" edc:nzwidth="0x10" ltx:memberofperipheral="TCA0"/>
    </edc:RegisterMap>
  </edc:DataSpace>
  <edc:PinList edc:ppsflavor="atmel">
    <edc:Pin>
      <edc:VirtualPin edc:name="PA7"/>
      <edc:VirtualPin edc:name="EVOUT0" edc:ppsfunction="EVSYS_ALT" ltx:memberofperipheral="EVSYS"/>
      <edc:VirtualPin edc:name="OUT" edc:ppsfunction="ZCD0" ltx:memberofperipheral="ZCD0"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="AC0" ltx:memberofperipheral="AC0"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="AC1" ltx:memberofperipheral="AC1"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="AC2" ltx:memberofperipheral="AC2"/>
      <edc:VirtualPin edc:name="PIN7" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTA"/>
      <edc:VirtualPin edc:name="SS" edc:ppsfunction="SPI0" ltx:memberofperipheral="SPI0"/>
      <edc:VirtualPin edc:name="WOD3D0" edc:ppsfunction="TCD0" ltx:memberofperipheral="TCD0"/>
      <edc:VirtualPin edc:name="XDIR" edc:ppsfunction="USART0_ALT" ltx:memberofperipheral="USART0"/>
      <edc:VirtualPin edc:name="XY7" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC0"/>
      <edc:VirtualPin edc:name="LUT1_IN0" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="MOSI" edc:ppsfunction="SPI1" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="PIN0" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTC"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART1" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="WO0A0" edc:ppsfunction="TCA0_ALT2" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="WO0B2" edc:ppsfunction="TCB2" ltx:memberofperipheral="TCB2"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC1"/>
      <edc:VirtualPin edc:name="LUT1_IN1" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="MISO" edc:ppsfunction="SPI1" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="PIN1" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTC"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART1" ltx:memberofperipheral="USART1"/>
      <edc:VirtualPin edc:name="WO1A0" edc:ppsfunction="TCA0_ALT2" ltx:memberofperipheral="TCA0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC2"/>
      <edc:VirtualPin edc:name="EVOUT2" edc:ppsfunction="EVSYS" ltx:memberofperipheral="EVSYS"/>
      <edc:VirtualPin edc:name="LUT1_IN2" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="PIN2" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTC"/>
      <edc:VirtualPin edc:name="SCK" edc:ppsfunction="SPI1" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="SDA" edc:ppsfunction="I2C0_ALT" ltx:memberofperipheral="TWI0"/>
      <edc:VirtualPin edc:name="WO2A0" edc:ppsfunction="TCA0_ALT2" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="USART1" ltx:memberofperipheral="USART1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC3"/>
      <edc:VirtualPin edc:name="LUT1_OUT0" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="PIN3" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTC"/>
      <edc:VirtualPin edc:name="SCL" edc:ppsfunction="I2C0_ALT" ltx:memberofperipheral="TWI0"/>
      <edc:VirtualPin edc:name="SS" edc:ppsfunction="SPI1" ltx:memberofperipheral="SPI1"/>
      <edc:VirtualPin edc:name="WO3A0" edc:ppsfunction="TCA0_ALT2" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="XDIR" edc:ppsfunction="USART1" ltx:memberofperipheral="USART1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD0"/>
      <edc:VirtualPin edc:name="AIN0" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="LUT2_IN0" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="N1" edc:ppsfunction="AC0" ltx:memberofperipheral="AC0"/>
      <edc:VirtualPin edc:name="N1" edc:ppsfunction="AC1" ltx:memberofperipheral="AC1"/>
      <edc:VirtualPin edc:name="N1" edc:ppsfunction="AC2" ltx:memberofperipheral="AC2"/>
      <edc:VirtualPin edc:name="PIN0" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTD"/>
      <edc:VirtualPin edc:name="WO0A0" edc:ppsfunction="TCA0_ALT3" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="XY16" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD1"/>
      <edc:VirtualPin edc:name="AIN1" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="IN" edc:ppsfunction="ZCD0" ltx:memberofperipheral="ZCD0"/>
      <edc:VirtualPin edc:name="LUT2_IN1" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="PIN1" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTD"/>
      <edc:VirtualPin edc:name="WO1A0" edc:ppsfunction="TCA0_ALT3" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="XY17" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD2"/>
      <edc:VirtualPin edc:name="AIN2" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="EVOUT3" edc:ppsfunction="EVSYS" ltx:memberofperipheral="EVSYS"/>
      <edc:VirtualPin edc:name="LUT2_IN2" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="P0" edc:ppsfunction="AC0" ltx:memberofperipheral="AC0"/>
      <edc:VirtualPin edc:name="P0" edc:ppsfunction="AC1" ltx:memberofperipheral="AC1"/>
      <edc:VirtualPin edc:name="P0" edc:ppsfunction="AC2" ltx:memberofperipheral="AC2"/>
      <edc:VirtualPin edc:name="PIN2" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTD"/>
      <edc:VirtualPin edc:name="WO2A0" edc:ppsfunction="TCA0_ALT3" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="XY18" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD3"/>
      <edc:VirtualPin edc:name="AIN3" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="LUT2_OUT0" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="N0" edc:ppsfunction="AC0" ltx:memberofperipheral="AC0"/>
      <edc:VirtualPin edc:name="P1" edc:ppsfunction="AC1" ltx:memberofperipheral="AC1"/>
      <edc:VirtualPin edc:name="PIN3" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTD"/>
      <edc:VirtualPin edc:name="WO3A0" edc:ppsfunction="TCA0_ALT3" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="XY19" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD4"/>
      <edc:VirtualPin edc:name="AIN4" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="P1" edc:ppsfunction="AC2" ltx:memberofperipheral="AC2"/>
      <edc:VirtualPin edc:name="P2" edc:ppsfunction="AC1" ltx:memberofperipheral="AC1"/>
      <edc:VirtualPin edc:name="PIN4" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTD"/>
      <edc:VirtualPin edc:name="WO4A0" edc:ppsfunction="TCA0_ALT3" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="XY20" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD5"/>
      <edc:VirtualPin edc:name="AIN5" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="N0" edc:ppsfunction="AC1" ltx:memberofperipheral="AC1"/>
      <edc:VirtualPin edc:name="PIN5" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTD"/>
      <edc:VirtualPin edc:name="WO5A0" edc:ppsfunction="TCA0_ALT3" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="XY21" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD6"/>
      <edc:VirtualPin edc:name="AIN6" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="LUT2_OUT0" edc:ppsfunction="CCL_ALT" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="OUT0" edc:ppsfunction="DAC0" ltx:memberofperipheral="DAC0"/>
      <edc:VirtualPin edc:name="P3" edc:ppsfunction="AC0" ltx:memberofperipheral="AC0"/>
      <edc:VirtualPin edc:name="P3" edc:ppsfunction="AC1" ltx:memberofperipheral="AC1"/>
      <edc:VirtualPin edc:name="P3" edc:ppsfunction="AC2" ltx:memberofperipheral="AC2"/>
      <edc:VirtualPin edc:name="PIN6" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTD"/>
      <edc:VirtualPin edc:name="XY22" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD7"/>
      <edc:VirtualPin edc:name="AIN7" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="EVOUT3" edc:ppsfunction="EVSYS_ALT" ltx:memberofperipheral="EVSYS"/>
      <edc:VirtualPin edc:name="N0" edc:ppsfunction="AC2" ltx:memberofperipheral="AC2"/>
      <edc:VirtualPin edc:name="N2" edc:ppsfunction="AC0" ltx:memberofperipheral="AC0"/>
      <edc:VirtualPin edc:name="N2" edc:ppsfunction="AC1" ltx:memberofperipheral="AC1"/>
      <edc:VirtualPin edc:name="N2" edc:ppsfunction="AC2" ltx:memberofperipheral="AC2"/>
      <edc:VirtualPin edc:name="PIN7" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTD"/>
      <edc:VirtualPin edc:name="XY23" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AVDD"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="AGND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PF0"/>
      <edc:VirtualPin edc:name="AIN16" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="LUT3_IN0" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="PIN0" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTF"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART2" ltx:memberofperipheral="USART2"/>
      <edc:VirtualPin edc:name="WO0A0" edc:ppsfunction="TCA0_ALT5" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="WOAD0" edc:ppsfunction="TCD0_ALT2" ltx:memberofperipheral="TCD0"/>
      <edc:VirtualPin edc:name="XTAL32K1" edc:ppsfunction="CLKCTRL" ltx:memberofperipheral="CLKCTRL"/>
      <edc:VirtualPin edc:name="XY32" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PF1"/>
      <edc:VirtualPin edc:name="AIN17" edc:ppsfunction="AIN0" ltx:memberofperipheral="ADC0"/>
      <edc:VirtualPin edc:name="LUT3_IN1" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="PIN1" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTF"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART2" ltx:memberofperipheral="USART2"/>
      <edc:VirtualPin edc:name="WO1A0" edc:ppsfunction="TCA0_ALT5" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="WOB1D0" edc:ppsfunction="TCD0_ALT2" ltx:memberofperipheral="TCD0"/>
      <edc:VirtualPin edc:name="XTAL32K2" edc:ppsfunction="CLKCTRL" ltx:memberofperipheral="CLKCTRL"/>
      <edc:VirtualPin edc:name="XY33" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PF6"/>
      <edc:VirtualPin edc:name="PIN6" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTF"/>
      <edc:VirtualPin edc:name="RESET" edc:ppsfunction="OTHER" ltx:memberofperipheral="RSTCTRL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="UPDI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDD0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND0"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA0"/>
      <edc:VirtualPin edc:name="CLKI" edc:ppsfunction="CLKCTRL" ltx:memberofperipheral="CLKCTRL"/>
      <edc:VirtualPin edc:name="LUT0_IN0" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="PIN0" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTA"/>
      <edc:VirtualPin edc:name="TXD" edc:ppsfunction="USART0" ltx:memberofperipheral="USART0"/>
      <edc:VirtualPin edc:name="WO0A0" edc:ppsfunction="TCA0" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="XY0" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA1"/>
      <edc:VirtualPin edc:name="LUT0_IN1" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="PIN1" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTA"/>
      <edc:VirtualPin edc:name="RXD" edc:ppsfunction="USART0" ltx:memberofperipheral="USART0"/>
      <edc:VirtualPin edc:name="WO1A0" edc:ppsfunction="TCA0" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="XY1" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA2"/>
      <edc:VirtualPin edc:name="EVOUT0" edc:ppsfunction="EVSYS" ltx:memberofperipheral="EVSYS"/>
      <edc:VirtualPin edc:name="LUT0_IN2" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="PIN2" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTA"/>
      <edc:VirtualPin edc:name="SDA" edc:ppsfunction="I2C0" ltx:memberofperipheral="TWI0"/>
      <edc:VirtualPin edc:name="WO0B0" edc:ppsfunction="TCB0" ltx:memberofperipheral="TCB0"/>
      <edc:VirtualPin edc:name="WO2A0" edc:ppsfunction="TCA0" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="XCK" edc:ppsfunction="USART0" ltx:memberofperipheral="USART0"/>
      <edc:VirtualPin edc:name="XY2" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA3"/>
      <edc:VirtualPin edc:name="LUT0_OUT0" edc:ppsfunction="CCL" ltx:memberofperipheral="CCL"/>
      <edc:VirtualPin edc:name="PIN3" edc:ppsfunction="IOPORT" ltx:memberofperipheral="PORTA"/>
      <edc:VirtualPin edc:name="SCL" edc:ppsfunction="I2C0" ltx:memberofperipheral="TWI0"/>
      <edc:VirtualPin edc:name="WO0B1" edc:ppsfunction="TCB1" ltx:memberofperipheral="TCB1"/>
      <edc:VirtualPin edc:name="WO3A0" edc:ppsfunction="TCA0" ltx:memberofperipheral="TCA0"/>
      <edc:VirtualPin edc:name="XDIR" edc:ppsfunction="USART0" ltx:memberofperipheral="USART0"/>
      <edc:VirtualPin edc:name="XY3" edc:ppsfunction="PTC" ltx:memberofperipheral="PTC"/>
    </edc:Pin>
